app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
---
	def index
		@movie = Movie.find(params[:movie_id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
---
	def new
		@movie = Movie.find(params[:movie_id])